html/lazy_tree.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-16 Wed 18:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lazy trees</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Hsin-Hao Yu" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Lazy trees</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0b8c7a6">1. Representing lazy trees</a></li>
<li><a href="#org5cde38d">2. Flattening lazy trees</a></li>
<li><a href="#org3770e0f">3. Mapping functions to lazy trees</a></li>
<li><a href="#org7499949">4. Other useful functions</a></li>
</ul>
</div>
</div>
<p>
Recall that in <code>foldtree.org</code>, we used a higher-order function <code>foldtree</code> to define functions that operate on trees. My Python codes seem to translate the logic well, but there is a big difference: Because Hughes used a lazy functional language, his code operates on lazy trees, meaning that he could write a function that generates an enormous or even infinite tree, without actually evaluating all the nodes. This characteristic is very useful for implementing complex algorithms that we will see in the next section.
</p>

<p>
Lazy evaluation is not integral to Python, so we have to write extra codes. I've found it difficult to write a lazy version of the higher-order function <code>foldtree</code> in Python, so I will do it less elegantly. I will just lazify <code>treelabels</code> and <code>maptree</code> in the style of Python's generators.
</p>

<div id="outline-container-org0b8c7a6" class="outline-2">
<h2 id="org0b8c7a6"><span class="section-number-2">1</span> Representing lazy trees</h2>
<div class="outline-text-2" id="text-1">
<p>
As in <code>foldtree.org</code>, a lazy tree is a tuple with a label and a collection of subtrees. For laziness, the subtrees have to be stored in an iterator rather than in a list.
</p>

<p>
Some simple utilities:
</p>
<div class="org-src-container">
<pre class="src src-python">def mk_tree(label, subtrees):
    return (label, subtrees)

def decompose_tree(t):
    try:
	label, subtrees = t[0], t[1]
	return label, subtrees
    except ValueError:
	raise Exception("Not a tree")
</pre>
</div>

<p>
Let's build the same tree in <code>foldtree.org</code>, replacing lists with iterators: 
</p>
<div class="org-src-container">
<pre class="src src-python">from lazy_utils import *

def mk_tree_(label, lst):
    """A throw-away function just for this example"""
    return (label, iter(lst))

def mk_test_tree():
    my_tree = mk_tree_(1, [
			   mk_tree_(2, []),
			   mk_tree_(3, [
					mk_tree_(4, [])
				       ]
			    )
			   ])
    return my_tree
</pre>
</div>
</div>
</div>

<div id="outline-container-org5cde38d" class="outline-2">
<h2 id="org5cde38d"><span class="section-number-2">2</span> Flattening lazy trees</h2>
<div class="outline-text-2" id="text-2">
<p>
This version returns an iterator, which visits every label in the tree one by one:
</p>

<div class="org-src-container">
<pre class="src src-python">def tree_labels(t):
    label, subtrees = decompose_tree(t)
    yield label
    for i in subtrees:
	for j in tree_labels(i):
	    yield j
</pre>
</div>

<p>
Let's try it. Note that <code>tree_labels</code> is lazy. It returns an iterator. I use <code>list(t)</code> to convert it to a regular list.
</p>
<div class="org-src-container">
<pre class="src src-python">def test_tree_labels():
    t = mk_test_tree()
    i = tree_labels(t)
    assert list(i) == [1, 2, 3, 4]
</pre>
</div>
</div>
</div>

<div id="outline-container-org3770e0f" class="outline-2">
<h2 id="org3770e0f"><span class="section-number-2">3</span> Mapping functions to lazy trees</h2>
<div class="outline-text-2" id="text-3">
<p>
This version of <code>maptree</code> maps a function <code>f</code> to all labels in the input, and returns another lazy tree. 
</p>

<div class="org-src-container">
<pre class="src src-python">def mapforest_(f, forest):
    for t in forest:
	yield maptree(f, t)

def maptree(f, t):
    label, subtrees = decompose_tree(t)
    return mk_tree(f(label),
		   mapforest_(f, subtrees))
</pre>
</div>

<p>
Let's try it. I use the <code>tree_labels</code> function to collect all the labels in the returned lazy tree.
</p>

<div class="org-src-container">
<pre class="src src-python">def test_maptree():
    def f(n):
	return -1 * n

    t = mk_test_tree()
    t = maptree(f, t)
    t = tree_labels(t)
    assert list(t) == [-1, -2, -3, -4]
</pre>
</div>
</div>
</div>

<div id="outline-container-org7499949" class="outline-2">
<h2 id="org7499949"><span class="section-number-2">4</span> Other useful functions</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-python">def tree_size(t):
    label, subtrees = decompose_tree(t)

    count  = 1
    for t in subtrees:
	count = count + tree_size(t)
    return count
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">def test_tree_size():
    t = mk_test_tree()
    s = tree_size(t)
    assert s == 4
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">def tree_depth(t):
    def tree_depth_(t, d):
	label, subtrees = decompose_tree(t)

	mx = d
	for t_ in subtrees:
	    mx = max(mx, tree_depth_(t_, d + 1))
	return mx

    return tree_depth_(t, 1)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">def test_tree_depth():
    t = mk_test_tree()
    d = tree_depth(t)
    assert d == 3
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Hsin-Hao Yu</p>
<p class="date">Created: 2022-03-16 Wed 18:10</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
